Term4/matlog/lectures/12.tex
% Created 2022-06-11 Sat 01:27
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{fancyhdr}
\usepackage{lastpage}
\usepackage{titling}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{algorithm}
\usepackage{algorithmic}
\usepackage{lipsum}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{svg}
\usepackage{capt-of}
\newcommand{\gedel}[1]{\custombracket{\ulcorner}{\urcorner}{#1}}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\input{~/.emacs.d/preamble.sty}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 12}
\hypersetup{
	pdfauthor={Ilya Yaroshevskiy},
	pdftitle={Лекция 12},
	pdfkeywords={},
	pdfsubject={},
	pdfcreator={Emacs 28.1 (Org mode 9.5.3)},
	pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Теория множеств}
\label{sec:org0a12783}
\begin{definition}
	\textbf{Теория множеств} --- теория первого порядка с нелогическим предикатом `принадлежность` \((\in)\) и следующими аксиомами и схемами аксиом.
	\label{org4d8496b}
\end{definition}
\begin{definition}
	B -- \textbf{бинарное отношение} на \(X\): \(B \subseteq X^2\)
	\[ \pair{a, b} = \{\{a\}, \{a, b\}\} \]
	\[ \mathop{\rm snd}\pair{a, b} = \bigcup\left(\bigcup \pair{a, b} \setminus \bigcap \pair{a, b}\right) = \{b\} \]
	\[ \mathop{\rm fst}\pair{a, b} = \bigcup\left(\bigcap \pair{a, b}\right) = \{a\} \]
	\label{orge45573e}
\end{definition}
\begin{definition}
	\(a \subseteq b\), если \(\forall x. x \in a \to x \in b\)
	\label{orge772436}
\end{definition}
\begin{remark}
	Что такое равенство?
	\begin{itemize}
		\item Duck typing: принцип Лейбница (неразличимость) --- \(A = B\), если для любого \(P \quad P(A) \leftrightarrow P(B)\) \\
		      \(a \leftrightarrow b\), если \((a \to b)\&(b \to a)\)
		\item Определение равенства как структур в C (принцип объемности) --- \(A\) и \(B\) состоят из одинаковых элементов
	\end{itemize}
\end{remark}
\begin{definition}
	\(a = b\), если \(a \subseteq b \& b \subseteq a\)
	\label{orgf6aa984}
\end{definition}
\begin{remark}
	Пустое множество имеет тип 0, множество с одним элементов имеет тип 1 и т.д. Запретим запросы `принадлежит` на одинаковых типах
\end{remark}
\begin{definition}
	``Предикат`` \(P(x)\) --- множество \(\{x \big| P(x)\}\)
	\label{org60dad37}
\end{definition}
\begin{axiom}[равенства]
	Равные множества содержатся в одних и тех же множествах
	\[ \forall a.\forall b.\forall c. a = b\&a\in c\to b \in c \]
	\label{orge0c849f}
\end{axiom}
\begin{axiom}[пустого множества]
	Существует \(\varnothing\): \(\forall x. \neg x \in \varnothing\)
	\label{org001ca4f}
\end{axiom}
\begin{axiom}[пары]
	Если \(a \neq b\), то \(\{a, b\}\) --- множество
	\[ \forall a. \forall b. a\neq b \to \exists p. a \in p \& b\in p \& \forall t. t \in p \to t = a \vee t = b \]
	\label{orgc77f1a7}
\end{axiom}
\begin{axiom}[объединения]
	Если \(x\) --- непустое множество, то \(\bigcup x\) --- множество
	\[ \forall x. (\exists y. y \in x) \to \exists p. \forall y. y\in p \leftrightarrow \exists s. y \in s \& s \in x \]
	\label{org04a2eee}
\end{axiom}
\begin{examp}
	\[ \bigcup \{1, \{2, 3\}, \{\{4\}\}\} = 1 \cup \{2, 3, \{4\}\}\]
	Почему \(2 \in p\), потому что \(2 \in \underbrace{\{2 , 3\}}_s,\ \{2, 3\} \in x\)
\end{examp}
\begin{axiom}[Степени]
	Для множества \(x\), существует \(\mathcal{P}(x)\) --- множество всех подмножеств
	\[ \forall x. \exists p. \forall y. y\in p \leftrightarrow y \subseteq x  \]
	\label{org3644d5a}
\end{axiom}
\begin{examp}
	\[ \mathcal{P}(\{a, b\}) = \{\varnothing, \{a\}, \{b\}, \{a, b\}\} \]
	\[ \mathcal{P}(\{\{4\}\}) = \{\varnothing, \{\{4\}\}\} \]
\end{examp}
\begin{axiom}[Схема аксиом выделения]
	Если \(a\) --- множество, \(\varphi(x)\) --- формула, в которую не входит свободно \(b\), то \(\{x \big| x \in a \& \varphi(x)\}\) --- множество
	\[ \forall x. \exists b. \forall y. y \in b \leftrightarrow y \in x \& \varphi(y) \]
	\label{org240fb46}
\end{axiom}
\begin{axiom}[Аксиома бесконечности]
	Существуют множества \(N\), такие, что
	\[ \varnothing \in N \& \forall x. x \in N \to x \cup \{x\} \in N \]
	\label{orgd559ac7}
\end{axiom}
\begin{theorem}
	Если \(x\) --- множество, то \(\{x\}\) --- множество
	\[ \exists t. a \in t \leftrightarrow a = x \]
\end{theorem}
\begin{proof}
	\-
	\begin{itemize}
		\item \(x = \varnothing\), тогда \(t \coloneqq \mathcal{P}(x)\), \(\mathcal{P}(\varnothing) = \varnothing\)
		\item \(x \neq \varnothing\), тогда \(s \coloneqq \{x, \varnothing\}\) --- аксиома пары, \(t \coloneqq \{z \big| z \in s \& z \neq \varnothing\}\)
	\end{itemize}
	\label{orgdaefbb7}
\end{proof}
\begin{theorem}
	\(a, b\) --- множества, то \(a \cup b\) --- множество
\end{theorem}
\begin{proof}
	\-
	\begin{itemize}
		\item \(a = b\), тогда \(a\cup b = a\) \hyperref[orgdaefbb7]{по теореме}
		\item \(a \neq b\), тогда \(a\cup b = \bigcup\{a, b\}\) \hyperref[orgc77f1a7]{по аксиоме}
	\end{itemize}
\end{proof}
\begin{symb}
	\(a, b\) --- множества, \(a \cup b =\) такое \(c\)
	\[ a \subseteq c \& b \subseteq c \& \forall t. t\in c \to t \in a \vee t \in b \]
\end{symb}
\begin{definition}
	\(a' = a \cup \{a\}\)
	\label{org7fb50af}
\end{definition}
\begin{definition}
	\textbf{Ординальные числа}
	\begin{itemize}
		\item \(\overline{0} = \varnothing\)
		\item \(\overline{1} = \varnothing' = \{\varnothing\}\)
		\item \(\overline{2} = \varnothing'' = \{\varnothing\}' = \{\varnothing, \{\varnothing\}\}\)
		\item \(\dots\)
	\end{itemize}
	\label{org218e5fa}
\end{definition}
\begin{definition}
	Множество \(S\) \textbf{транзитивно}, если
	\[ \forall a. \forall b. a \in b \& b \in S \to a \in S \]
	\label{orgf3884fa}
\end{definition}
\begin{definition}
	Множество \(S\) \textbf{вполне упорядочено} отношением \(\in\), если
	\begin{enumerate}
		\item \(\forall a. \forall b. a\neq b\& a \in S \& b \in S \to a \in b \vee b \in a\) --- линейный
		\item \(\forall t. t \subseteq S \to \exists a. a\in t \&\forall b. b \in t \to b = a \vee a \in b\) --- в любом подмножестве есть наименьший элемент
	\end{enumerate}
	\label{org75fb523}
\end{definition}
\begin{definition}
	\textbf{Ординал} (Ординальное число) --- вполне упорядоченное отношением \(\in\), транзитивное множество
	\label{orga75a597}
\end{definition}
\begin{definition}
	\textbf{Предельный ординал} \(s \neq \varnothing\) --- ординал, не имеющий предшественника
	\[ \forall p. p' \neq s \]
	\label{org814664c}
\end{definition}
\begin{examp}
	\[ \omega = \{\varnothing, 1, 2, 3, 4, \dots\} \]
	Очевидно, что \(\omega \subseteq N\) (из \hyperref[orgd559ac7]{аксиомы бесконечности})
	\label{orgb4e2af9}
\end{examp}
\begin{theorem}
	\(\omega\) --- множество
	\label{orgf8c5c93}
\end{theorem}
\begin{definition}
	\[ a + b = \begin{cases}
			a                            & b = 0                               \\
			(a + c)'                     & b = c'                              \\
			\sup\limits_{c \in b}(a + c) & \text{если }b\text{ --- предельный}
		\end{cases} \]
	\label{org85b4e0c}
\end{definition}
\begin{definition}
	\(\sup t\) --- минимальный ординал, содержащий все элементы из \(t\)
	\label{orgb6e1e1c}
\end{definition}
\begin{examp}
	\(\{0, 1, 3\}\) --- ординал?
	\begin{itemize}
		\item упорядоченный
		\item \uline{не транзитивный}
	\end{itemize}
	\(\sup \{0, 1, 3\} = \{0, 1, 2, 3\}\)
\end{examp}
\begin{examp}
	\[1 + \omega = \sup\limits_{c \in \omega}(1 + c) = \sup \{0 + 1, 1 + 1, 2+ 1, \dots\}\]
	\[ \sup \{1, 2, 3, 4, 5, \dots\} = \omega \]
	\label{orgb9de87e}
\end{examp}
\begin{examp}
	\[ \omega + 1 = \omega' = \omega \cup \{\omega\} = \{0, 1, 2, 3, \dots, \omega\} \]
	\label{orga650da3}
\end{examp}
\end{document}
